#include <stdio.h>

/*В обратном порядке
Дано целое неотрицательное число N. Выведите все его цифры по одной, в обратном порядке, разделяя их пробелами или новыми строками. 
Данные на входе: 		Одно неотрицательное целое число 
Данные на выходе: 	Последовательность цифр введенного числа в обратном порядке через пробел 

Пример №1
Данные на входе: 		15 
Данные на выходе: 	5 1 

Пример №2
Данные на входе: 		54321 
Данные на выходе: 	1 2 3 4 5 */

void rec(int n);

int main(void) {
    int n;
    scanf("%d", &n);
    rec(n);
    return 0;
}

void rec(int n) {
    printf("%d\n", n % 10);
    n /= 10;
    if (n > 0) {
        rec(n);
    }
}