#include <stdio.h>
#define SIZE 8

/*Клетки
Известно, что шахматная доска имеет размерность 8х8 и состоит из клеток 2х цветов, например, черного и белого (см. рисунок). 
Каждая клетка имеет координату, состоящую из буквы и цифры. Горизонтальное расположение клетки определяется буквой от A до H, 
а вертикальное – цифрой от 1 до 8. Заметим, что клетка с координатой А1 имеет черный цвет. 
Требуется по заданной координате определить цвет клетки.


Данные на входе: 		В единственной строке записана координата клетки на шахматной доске: всего два символа – 
буква и цифра (без пробелов). 
Данные на выходе: 	В выходной файл нужно вывести «WHITE», если указанная клетка имеет белый цвет и «BLACK», если она черная. 

Пример №1
Данные на входе: 		C3 
Данные на выходе: 	BLACK 

Пример №2
Данные на входе: 		G8 
Данные на выходе: 	WHITE*/

void init_chess(int n, int chess[n][n]);
void print_color(char c, int i);

int main(void) {
    char c;
    int i;
    scanf("%c%d", &c, &i);
    print_color(c, i);
    return 0;
}

void init_chess(int n, int chess[n][n]) {
    int flag = 1;
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++) {
            chess[i][j] = flag > 0 ? 1 : 0;
            flag *= -1;
        }
    }
}

void print_color(char c, int i) {
    int chess[SIZE][SIZE];
    init_chess(SIZE, chess);
    int j = c - 17;
    printf("%s\n", chess[i - 1][j] ? "BLACK" : "WHITE");
}